/*** 温度采集相关 ***/

#include "temperature.h"
#include "utils.c"

/*******************************************************************************
* 函 数 名          : Ds18b20Init
* 函数功能		    : 初始化
* 输   入          : 无
* 输   出          : 初始化成功返回1，失败返回0
*******************************************************************************/
uchar Ds18b20Init()
{
    uchar i;
    DSPORT = 0; //将总线拉低480us~960us
    i = 70;
    while (i--)
        ;       //延时642us
    DSPORT = 1; //然后拉高总线，如果DS18B20做出反应会将在15us~60us后总线拉低
    i = 0;
    while (DSPORT) //等待DS18B20拉低总线
    {
        Delay1ms(1);
        i++;
        if (i > 5) //等待>5MS
        {
            return 0; //初始化失败
        }
    }
    return 1; //初始化成功
}

/*******************************************************************************
* 函 数 名         : Ds18b20WriteByte
* 函数功能		   : 向18B20写入一个字节
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/
void Ds18b20WriteByte(uchar dat)
{
    uint i, j;

    for (j = 0; j < 8; j++)
    {
        DSPORT = 0; //每写入一位数据之前先把总线拉低1us
        i++;
        DSPORT = dat & 0x01; //然后写入一个数据，从最低位开始
        i = 6;
        while (i--)
            ;       //延时68us，持续时间最少60us
        DSPORT = 1; //然后释放总线，至少1us给总线恢复时间才能接着写入第二个数值
        dat >>= 1;
    }
}

/*******************************************************************************
* 函 数 名         : Ds18b20ReadByte
* 函数功能		   : 读取一个字节
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/
uchar Ds18b20ReadByte()
{
    uchar byte, bi;
    uint i, j;
    for (j = 8; j > 0; j--)
    {
        DSPORT = 0; //先将总线拉低1us
        i++;
        DSPORT = 1; //然后释放总线
        i++;
        i++;         //延时6us等待数据稳定
        bi = DSPORT; //读取数据，从最低位开始读取
        /*将byte左移一位，然后与上右移7位后的bi，注意移动之后移掉那位补0。*/
        byte = (byte >> 1) | (bi << 7);
        i = 4; //读取完之后等待48us再接着读取下一个数
        while (i--)
            ;
    }
    return byte;
}

/*******************************************************************************
* 函 数 名         : Ds18b20ChangTemp
* 函数功能		   : 让18b20开始转换温度
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/
void Ds18b20ChangTemp()
{
    Ds18b20Init();
    Delay1ms(1);
    Ds18b20WriteByte(0xcc); //跳过ROM操作命令
    Ds18b20WriteByte(0x44); //温度转换命令
                            //Delay1ms(100);	//等待转换成功，而如果你是一直刷着的话，就不用这个延时了
}

/*******************************************************************************
* 函 数 名         : Ds18b20ReadTempCom
* 函数功能		   : 发送读取温度命令
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/
void Ds18b20ReadTempCom()
{

    Ds18b20Init();
    Delay1ms(1);
    Ds18b20WriteByte(0xcc); //跳过ROM操作命令
    Ds18b20WriteByte(0xbe); //发送读取温度命令
}

/*******************************************************************************
* 函 数 名         : Ds18b20ReadTemp
* 函数功能		   : 读取温度
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/
int Ds18b20ReadTemp()
{
    int temp = 0;
    uchar tmh, tml;
    Ds18b20ChangTemp();      //先写入温度转换命令
    Ds18b20ReadTempCom();    //然后等待转换完后发送读取温度命令
    tml = Ds18b20ReadByte(); //读取温度值共16位，先读低字节
    tmh = Ds18b20ReadByte(); //再读高字节
    temp = tmh;
    temp <<= 8;
    temp |= tml;
    return temp;
}

/*******************************************************************************
* 函数名   : datapros()
* 函数功能 : 温度读取处理转换函数
* 输入    : temp
* 输出    : 无
*******************************************************************************/
void DataTrans(int temp)
{
    float tp;
    if (temp < 0) //当温度值为负数
    {
        DisplayData[0] = 0x40; //   -
        //因为读取的温度是实际温度的补码，所以减1，再取反求出原码
        temp = temp - 1;
        temp = ~temp;
        tp = temp;
        temp = tp * 0.0625 * 100 + 0.5;
        //留两个小数点就*100，+0.5是四舍五入，因为C语言浮点数转换为整型的时候把小数点
        //后面的数自动去掉，不管是否大于0.5，而+0.5之后大于0.5的就是进1了，小于0.5的就
        //算加上0.5，还是在小数点后面。
    }
    else
    {
        DisplayData[0] = 0x00;
        tp = temp; //因为数据处理有小数点所以将温度赋给一个浮点型变量
        //如果温度是正的那么，那么正数的原码就是补码它本身
        temp = tp * 0.0625 * 100 + 0.5;
        //留两个小数点就*100，+0.5是四舍五入，因为C语言浮点数转换为整型的时候把小数点
        //后面的数自动去掉，不管是否大于0.5，而+0.5之后大于0.5的就是进1了，小于0.5的就
        //算加上0.5，还是在小数点后面。
    }
    hundred = temp / 10000;
    decade = temp % 10000 / 1000;
    unit = temp % 1000 / 100;
    zeroPointOne = temp % 100 / 10;
    zeroPointZeroOne = temp % 10;
    // 100-10-1.-0.1-0.01
    DisplayData[1] = smgduan[hundred];
    DisplayData[2] = smgduan[decade];
    DisplayData[3] = smgduan[unit] | 0x80;
    DisplayData[4] = smgduan[zeroPointOne];
    DisplayData[5] = smgduan[zeroPointZeroOne];
}

/*******************************************************************************
* 函数名         :DigDisplay()
* 函数功能       :数码管显示函数
* 输入           : 无
* 输出         	 : 无
*******************************************************************************/
void DigDisplay()
{
    u8 i;
    for (i = 0; i < 6; i++)
    {
        switch (i) //位选，选择点亮的数码管，
        {
        case (0):
            LSA = 0;
            LSB = 0;
            LSC = 0;
            break; //显示第0位
        case (1):
            LSA = 1;
            LSB = 0;
            LSC = 0;
            break; //显示第1位
        case (2):
            LSA = 0;
            LSB = 1;
            LSC = 0;
            break; //显示第2位
        case (3):
            LSA = 1;
            LSB = 1;
            LSC = 0;
            break; //显示第3位
        case (4):
            LSA = 0;
            LSB = 0;
            LSC = 1;
            break; //显示第4位
        case (5):
            LSA = 1;
            LSB = 0;
            LSC = 1;
            break; //显示第5位
        }
        P0 = DisplayData[i]; //发送数据
        delay(100);          //间隔一段时间扫描
        P0 = 0x00;           //消隐
    }
}
